#+title: Password hashing

* Base64
- Es un tipo de codificación de binario a texto (y vise-versa)
- No es para representar texto legible (como unicode)
- Cada cuatro bytes de la versión de texto equivalen a 3 bytes binarios
- La cadena de texto tiene que ser un múltiplo de 4
- En python se tiene la biblioteca base64

#+begin_src python :session *py* :results output :exports both :tangled /tmp/test.py
  import base64
  import os

  # binario a texto
  binario = os.urandom(9)
  print(binario)
  cadena = base64.b64encode(binario)
  print(cadena)
  print(len(binario), '-', len(cadena))
  texto = cadena.decode('utf-8')
  print(texto)

  # texto a binario
  original = base64.b64decode(texto.encode('utf-8'))
  print(original)
#+end_src

#+RESULTS:
: b'\xd0\xe8\x80A\xd1\x97i\xce\x85'
: b'0OiAQdGXac6F'
: 9 - 12
: 0OiAQdGXac6F
: b'\xd0\xe8\x80A\xd1\x97i\xce\x85'


* Crypt

#+begin_src python :session *py* :results output :exports both :tangled /tmp/test.py
  import crypt
  import os
  import base64

  contra = 'hola'
  salt = os.urandom(12)
  print(salt)
  salt = base64.b64encode(salt).decode('utf-8')
  print(salt)

  hash = crypt.crypt(contra, '$6$' + salt)
  print(hash)
#+end_src

#+RESULTS:
: b'\xff*\x8c%-U\xa1\xeb\xf52^\xa6'
: /yqMJS1Voev1Ml6m
: $6$/yqMJS1Voev1Ml6m$SjtB4GCxArrF7FIWR0S9Dq4bD2PDO3/T9w1.5PG.l6ezVPHddOyO/jwT0nIgPQp/EKdl/37/2fYIO8AIwud0D0
